/*--------------------------------------------------------------------------------------------------
// File : *.cpp, *.h
//
// Description:
//             (此处添加注释)
//
// Author: XXX
//
// Date: 2018-XX-XX
//
--------------------------------------------------------------------------------------------------*/

#include "stdafx.h"
#include "miniword.h"

TCHAR g_szHelpDocument[DOCUMENT_LENGTH] = {TEXT("************************************************** MiniWord Help Document **************************************************\n\
--使用本文档可解决您在使用途中遇见的大部分疑惑。若仍有不清楚的地方，请联系技术支持人员为您服务，联系方式为：qq1047839605。--\n\
------------------------------------------------------祝您使用愉快！--------------------------------------------------------\n\
\n\
1. 文件相关\n\
\t1.1.打开文件\n\
\t\t1.1.1 右键启动\n\
\t\t\t右键单击文件，选择“Open with MiniWord”即可。\n\
\n\
\t\t1.1.2 文件拖拽\n\
\t\t\t左键选中文件，拖拽至窗口显示区即可。\n\
\n\
\t\t1.1.3 菜单栏\n\
\t\t\t点击“打开”即可通过对话框选择文件打开。\n\
\n\
\t\t1.1.4 注意事项\n\
\t\t\t若当前文件未保存，需选择保存或者不保存该文件，取消则视为不保存。\n\
\n\
\t1.2.保存文件\n\
\t\t1.2.1 未设置保存路径\n\
\t\t\t默认保存路径为“C : \\MiniWord\\新建文件夹(a).txt”，\n\
\t\t\t其中“a”的取值为正整数，保证文件名不与默认保存目录冲突。\n\
\n\
\t\t1.2.2 已设置保存路径\n\
\t\t\t直接保存。\n\
\n\
\t\t1.2.3 注意事项\n\
\t\t\t未设置保存路径时，会提示用户是否使用默认保存路径，若用户选择“是”，\n\
\t\t\t则保存至该路径；“否”，则让用户选择保存路径；“取消”，则不保存该文件。\n\
\n\
\t1.3.另存为文件\n\
\t\t根据对话框提示设置保存路径进行保存即可。\n\
\t\t若用户选择取消或者直接关闭对话框，则不另存为文件。\n\
\t\t*注：另存为文件不保存当前文件，只是拷贝一份当前文件的副本至磁盘上。\n\
\n\
2. 字符相关\n\
\t2.1.插入字符\n\
\t\t2.1.1 英文字符\n\
\t\t\t支持“a - z”“A - Z”。\n\
\n\
\t\t2.1.2 中文字符\n\
\t\t\t支持GB2312编码字符集。\n\
\n\
\t\t2.1.3 其他字符\n\
\t\t\t“~!@#$%^&*()_ + {}:\"<>?/.,';][=-”。，；‘【】’1234567890\n\
\t\t\t以及制表符和换行符。\n\
\n\
\t2.2.删除字符\n\
\t\t2.2.1 Delete\n\
\t\t\t删除光标后一个字符或者高亮部分字符。\n\
\n\
\t\t2.2.2 Backspace\n\
\t\t\t删除光标前一个字符或者高亮部分字符。\n\
\n\
\t2.3.拷贝字符串\n\
\t\t拷贝高亮部分至剪切板，支持进程间通信。\n\
\n\
\t2.4.粘贴字符串\n\
\t\t从剪切板拷贝字符串至当前文本，插入的字符串不以高亮显示，支持进程间通信。\n\
\n\
\t2.5.区块选择\n\
\t\t按住鼠标左键，拖动鼠标即可完成区间选中。\n\
\t\t*注：当按住鼠标左键移动至接近窗口边缘处悬停时可以滑动窗口，便于选择当前页面无法显示的部分。\n\
\t2.6.查找\n\
\t\t可支持光标向前查找和向后查找，单击“查找下一个”可进行查找匹配的字符串，被查找到的字符串\n\
\t\t高亮显示。\n\
\n\
\t2.7.替换\n\
\t\t单击“替换”即可对于被查找的字符串进行替换。\n\
\t\t*注：只有在进行查找下一个操作成功后进行替换才会成功，否则失效。\n\
\n\
3. 光标操作\n\
\t3.1.UP\n\
\t\t光标上移一行（第一行则所在行数保持不变），所在列数保持不变。\n\
\n\
\t3.2.DOWN\n\
\t\t光标下移一行（最后一行则所在行数保持不变），所在列数保持不变。\n\
\n\
\t3.3.LEFT\n\
\t\t光标左移一列，所在行数保持不变（行首则移至上一行行尾）。\n\
\n\
\t3.4.RIGHT\n\
\t\t光标右移一列，所在行数保持不变（行尾则移至下一行行首）。\n\
\n\
\t3.5.HOME\n\
\t\t移至当前行首。\n\
\n\
\t3.6.END\n\
\t\t移至当前行尾。\n\
\n\
\t3.7.鼠标点击\n\
\t\t移至鼠标点击的位置。\n\
\n\
\t3.8.注意事项\n\
\t\t移动光标时，保证光标处于当前页面中。\n\
\n\
4. 滚动条操作\n\
\t4.1.拉动滚动条\n\
\t\t4.1.1 逐级滚动\n\
\t\t\t竖直滚动一行或者水平滚动一个中文字符的宽度。\n\
\n\
\t\t4.1.2 翻页滚动\n\
\t\t\t滚动当前页面能显示的行数或者列数。\n\
\n\
\t4.2.滚轮操作\n\
\t\t4.2.1 向前滑动\n\
\t\t\t向上滚动一行。\n\
\n\
\t\t4.2.2.向后滑动\n\
\t\t\t向下滚动一行。\n\
\n\
\t4.3.热键操作\n\
\t\t4.3.1 PAGEUP\n\
\t\t\t向上翻页。\n\
\n\
\t\t4.3.2 PAGEDOWN\n\
\t\t\t向下翻页。\n\
\n\
5. 快捷键操作\n\
\t5.1.新建\n\
\t\tctrl + n\n\
\n\
\t5.2.打开\n\
\t\tctrl + o\n\
\n\
\t5.3.保存\n\
\t\tctrl + s\n\
\n\
\t5.4.拷贝\n\
\t\tctrl + c\n\
\n\
\t5.5.粘贴\n\
\t\tctrl + v\n\
\n\
\t5.6.查找\n\
\t\tctrl + f\n\
\n\
\t5.7.替换\n\
\t\tctrl + h\n\
\n\
\t5.8.撤销\n\
\t\tctrl + z\n\
\n\
\t5.9.剪切\n\
\t\tctrl + x\n\
\n\
\t5.10.全选\n\
\t\tctrl + a\n\
\n\
\t5.11.关闭窗口\n\
\t\tesc\n\
\n\
6. 菜单栏\n\
\t6.1.文件\n\
\t\t“新建”“打开”“保存”“另存为”“退出”。\n\
\n\
\t6.2.编辑\n\
\t\t“查找”“替换”“拷贝”“剪切”“粘贴”“撤销”“全选”\n\
\n\
\t6.3.帮助\n\
\t\t“关于”\n\
\t\t*注：“关于”选项里可查看本帮助文档（使用说明）。\n\
\n\
7. 标题栏\n\
\t标题实时显示当前文件的文件名，若用户未设置当前文件的名称（即未设置文件保存路径），\n\
\t则使用默认的文件名做标题。\n\
\n\
8. 状态栏\n\
\t8.1.字符数目\n\
\t\t若无高亮部分，则显示文本全部字符数目；\n\
\t\t若有高亮部分，则显示文本高亮字符数目。\n\
\n\
\t8.2.光标位置\n\
\t\t“x rows, y cols”\n\
\t\t*注：“x”从1（最上端）开始取值，“y”从0（最左端）开始取值。\n\
\n\
9. 右键菜单栏\n\
\t除了含有菜单栏的部分操作外，支持插入时间戳的操作，其格式为“XXXX XX XX XX : XX:XX”。\n\
\n\
10. 其他功能\n\
\t10.1.字体大小\n\
\t\t按住ctrl键，滚动滚轮，即可调节字体大小。\n\
\n\
////////////////////////////////////////////////////// Have a nice try /////////////////////////////////////////////////////\n\
///////////////////////////////////////////////////// Thanks for using /////////////////////////////////////////////////////\n\
************************************************** MiniWord Help Document **************************************************\n\
")};